Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.1.68/atdf/ATSAML11E16A.atdf
      <value-group name="CCL_LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
        <value name="FILTER" caption="Filter enabled" value="2"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__EDGESEL">
        <value name="DISABLE" caption="Edge detector is disabled" value="0"/>
        <value name="ENABLE" caption="Edge detector is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL">
        <value name="MASK" caption="Masked input" value="0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="1"/>
        <value name="LINK" caption="Linked LUT input source" value="2"/>
        <value name="EVENT" caption="Event input source" value="3"/>
        <value name="IO" caption="I/O pin input source" value="4"/>
        <value name="AC" caption="AC input source" value="5"/>
        <value name="TC" caption="TC input source" value="6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="7"/>
        <value name="SERCOM" caption="SERCOM input source" value="9"/>
        <value name="ASYNCEVENT" caption="Asynchronous event input source" value="0xB"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INVEI">
        <value name="NORMAL" caption="Incoming event is not inverted" value="0"/>
        <value name="INVERTED" caption="Incoming event is inverted" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEI">
        <value name="DISABLE" caption="LUT incoming event is disabled" value="0"/>
        <value name="ENABLE" caption="LUT incoming event is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEO">
        <value name="DISABLE" caption="LUT event output is disabled" value="0"/>
        <value name="ENABLE" caption="LUT event output is enabled" value="1"/>
      </value-group>
    </module>
    <module name="DAC" id="U2214" version="2.1.0" caption="Digital Analog Converter">
      <register-group name="DAC" caption="Digital Analog Converter">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="RW" size="1" initval="0x00" caption="Control B">
          <bitfield name="EOEN" caption="External Output Enable" mask="0x1"/>
          <bitfield name="IOEN" caption="Internal Output Enable" mask="0x2"/>
          <bitfield name="LEFTADJ" caption="Left Adjusted Data" mask="0x4"/>
          <bitfield name="VPD" caption="Voltage Pump Disable" mask="0x8"/>
          <bitfield name="DITHER" caption="Dither Enable" mask="0x20"/>
          <bitfield name="REFSEL" caption="Reference Selection" mask="0xC0" values="DAC_CTRLB__REFSEL"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="STARTEI" caption="Start Conversion Event Input" mask="0x1"/>
          <bitfield name="EMPTYEO" caption="Data Buffer Empty Event Output" mask="0x2"/>
          <bitfield name="INVEI" caption="Invert Event Input" mask="0x4"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="UNDERRUN" caption="Underrun Interrupt Enable" mask="0x1"/>
          <bitfield name="EMPTY" caption="Data Buffer Empty Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="UNDERRUN" caption="Underrun Interrupt Enable" mask="0x1"/>
          <bitfield name="EMPTY" caption="Data Buffer Empty Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="UNDERRUN" caption="Underrun" mask="0x1"/>
          <bitfield name="EMPTY" caption="Data Buffer Empty" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x7" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="READY" caption="Ready" mask="0x1"/>
        </register>
        <register name="DATA" offset="0x8" rw="W" access="WSYNC" size="2" initval="0x0000" caption="Data">
          <bitfield name="DATA" caption="Data value to be converted" mask="0xFFFF"/>
        </register>
        <register name="DATABUF" offset="0xC" rw="W" access="WSYNC" size="2" initval="0x0000" caption="Data Buffer">
          <bitfield name="DATABUF" caption="Data Buffer" mask="0xFFFF"/>
        </register>
        <register name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="DATA" caption="Data" mask="0x4"/>
          <bitfield name="DATABUF" caption="Data Buffer" mask="0x8"/>
        </register>
        <register name="DBGCTRL" offset="0x14" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="DAC_CTRLB__REFSEL">
        <value name="INTREF" caption="Internal Voltage reference" value="0"/>
        <value name="VDDANA" caption="Analog Voltage Supply" value="1"/>
        <value name="VREFA" caption="External reference" value="2"/>
      </value-group>
    </module>
    <module name="DMAC" id="U2223" version="2.4.0" caption="Direct Memory Access Controller">
      <register-group name="DMAC" caption="Direct Memory Access Controller">
        <register name="CTRL" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="DMAENABLE" caption="DMA Enable" mask="0x2"/>
          <bitfield name="CRCENABLE" caption="CRC Enable" mask="0x4"/>
          <bitfield name="LVLEN0" caption="Priority Level 0 Enable" mask="0x100"/>
          <bitfield name="LVLEN1" caption="Priority Level 1 Enable" mask="0x200"/>
          <bitfield name="LVLEN2" caption="Priority Level 2 Enable" mask="0x400"/>
          <bitfield name="LVLEN3" caption="Priority Level 3 Enable" mask="0x800"/>
        </register>
        <register name="CRCCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="CRC Control">
          <bitfield name="CRCBEATSIZE" caption="CRC Beat Size" mask="0x3" values="DMAC_CRCCTRL__CRCBEATSIZE"/>
          <bitfield name="CRCPOLY" caption="CRC Polynomial Type" mask="0xC" values="DMAC_CRCCTRL__CRCPOLY"/>
          <bitfield name="CRCSRC" caption="CRC Input Source" mask="0x3F00" values="DMAC_CRCCTRL__CRCSRC"/>
        </register>
        <register name="CRCDATAIN" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CRC Data Input">
          <bitfield name="CRCDATAIN" caption="CRC Data Input" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCCHKSUM" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="CRC Checksum">
          <bitfield name="CRCCHKSUM" caption="CRC Checksum" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCSTATUS" offset="0xC" rw="RW" size="1" initval="0x00" caption="CRC Status">
          <bitfield name="CRCBUSY" caption="CRC Module Busy" mask="0x1"/>
          <bitfield name="CRCZERO" caption="CRC Zero" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0xD" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="QOSCTRL" offset="0xE" rw="RW" size="1" initval="0x2A" caption="QOS Control">
          <bitfield name="WRBQOS" caption="Write-Back Quality of Service" mask="0x3" values="DMAC_QOSCTRL__WRBQOS"/>
          <bitfield name="FQOS" caption="Fetch Quality of Service" mask="0xC" values="DMAC_QOSCTRL__FQOS"/>
          <bitfield name="DQOS" caption="Data Transfer Quality of Service" mask="0x30" values="DMAC_QOSCTRL__DQOS"/>
        </register>
        <register name="SWTRIGCTRL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Software Trigger Control">
          <bitfield name="SWTRIG0" caption="Channel 0 Software Trigger" mask="0x1"/>
          <bitfield name="SWTRIG1" caption="Channel 1 Software Trigger" mask="0x2"/>
          <bitfield name="SWTRIG2" caption="Channel 2 Software Trigger" mask="0x4"/>
          <bitfield name="SWTRIG3" caption="Channel 3 Software Trigger" mask="0x8"/>
          <bitfield name="SWTRIG4" caption="Channel 4 Software Trigger" mask="0x10"/>
          <bitfield name="SWTRIG5" caption="Channel 5 Software Trigger" mask="0x20"/>
          <bitfield name="SWTRIG6" caption="Channel 6 Software Trigger" mask="0x40"/>
          <bitfield name="SWTRIG7" caption="Channel 7 Software Trigger" mask="0x80"/>
        </register>
