Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.1.68/atdf/ATSAML11E16A.atdf
        <register name="USER_WORD_4" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="USER Page Word 4">
          <bitfield name="NONSECA_PAC" caption="PAC Non-Secure" mask="0x1"/>
          <bitfield name="NONSECA_PM" caption="PM Non-Secure" mask="0x2"/>
          <bitfield name="NONSECA_MCLK" caption="MCLK Non-Secure" mask="0x4"/>
          <bitfield name="NONSECA_RSTC" caption="RSTC Non-Secure" mask="0x8"/>
          <bitfield name="NONSECA_OSCCTRL" caption="OSCCTRL Non-Secure" mask="0x10"/>
          <bitfield name="NONSECA_OSC32KCTRL" caption="OSC32KCTRL Non-Secure" mask="0x20"/>
          <bitfield name="NONSECA_SUPC" caption="SUPC Non-Secure" mask="0x40"/>
          <bitfield name="NONSECA_GCLK" caption="GCLK Non-Secure" mask="0x80"/>
          <bitfield name="NONSECA_WDT" caption="WDT Non-Secure" mask="0x100"/>
          <bitfield name="NONSECA_RTC" caption="RTC Non-Secure" mask="0x200"/>
          <bitfield name="NONSECA_EIC" caption="EIC Non-Secure" mask="0x400"/>
          <bitfield name="NONSECA_FREQM" caption="FREQM Non-Secure" mask="0x800"/>
          <bitfield name="NONSECA_PORT" caption="PORT Non-Secure" mask="0x1000"/>
          <bitfield name="NONSECA_AC" caption="AC Non-Secure" mask="0x2000"/>
        </register>
        <register name="USER_WORD_5" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="USER Page Word 5">
          <bitfield name="NONSECB_IDAU" caption="IDAU Non-Secure" mask="0x1"/>
          <bitfield name="NONSECB_DSU" caption="DSU Non-Secure" mask="0x2"/>
          <bitfield name="NONSECB_NVMCTRL" caption="NVMCTRL Non-Secure" mask="0x4"/>
          <bitfield name="NONSECB_DMAC" caption="DMAC Non-Secure" mask="0x8"/>
        </register>
        <register name="USER_WORD_6" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="USER Page Word 6">
          <bitfield name="NONSECC_EVSYS" caption="EVSYS Non-Secure" mask="0x1"/>
          <bitfield name="NONSECC_SERCOM0" caption="SERCOM0 Non-Secure" mask="0x2"/>
          <bitfield name="NONSECC_SERCOM1" caption="SERCOM1 Non-Secure" mask="0x4"/>
          <bitfield name="NONSECC_SERCOM2" caption="SERCOM2 Non-Secure" mask="0x8"/>
          <bitfield name="NONSECC_TC0" caption="TC0 Non-Secure" mask="0x10"/>
          <bitfield name="NONSECC_TC1" caption="TC1 Non-Secure" mask="0x20"/>
          <bitfield name="NONSECC_TC2" caption="TC2 Non-Secure" mask="0x40"/>
          <bitfield name="NONSECC_ADC" caption="ADC Non-Secure" mask="0x80"/>
          <bitfield name="NONSECC_DAC" caption="DAC Non-Secure" mask="0x100"/>
          <bitfield name="NONSECC_PTC" caption="PTC Non-Secure" mask="0x200"/>
          <bitfield name="NONSECC_TRNG" caption="TRNG Non-Secure" mask="0x400"/>
          <bitfield name="NONSECC_CCL" caption="CCL Non-Secure" mask="0x800"/>
          <bitfield name="NONSECC_OPAMP" caption="OPAMP Non-Secure" mask="0x1000"/>
          <bitfield name="NONSECC_TRAM" caption="TRAM Non-Secure" mask="0x2000"/>
        </register>
        <register name="USER_WORD_7" offset="0x1C" rw="RW" size="4" initval="0x8433651E" caption="USER Page Word 7">
          <bitfield name="BOOTROM_USERCRC" caption="CRC for USER[1,2,3] DWORDS" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="SUPC_BOD33__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
        <value name="INT" caption="The BOD33 generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="WDT_CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
    </module>
    <module name="OPAMP" id="U2237" version="2.0.0" caption="Operational Amplifier">
      <register-group name="OPAMP" caption="Operational Amplifier">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="LPMUX" caption="Low-Power Mux" mask="0x80"/>
        </register>
        <register name="STATUS" offset="0x2" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="READY0" caption="OPAMP 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="OPAMP 1 Ready" mask="0x2"/>
          <bitfield name="READY2" caption="OPAMP 2 Ready" mask="0x4"/>
        </register>
