Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.1.68/atdf/ATSAML11E16A.atdf
      <value-group name="SCB_AIRCR__BFHFNMINS">
        <value name="SECURE" caption="BusFault, HardFault, and NMI are Secure" value="0x0"/>
        <value name="NON_SECURE" caption="BusFault and NMI are Non-secure and exceptions can target Non-secure HardFault" value="0x1"/>
      </value-group>
      <value-group name="SCB_AIRCR__ENDIANNESS">
        <value name="LITTLE" caption="Little-endian" value="0"/>
        <value name="BIG" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SCB_AIRCR__PRIS">
        <value name="SAME" caption="Priority ranges of Secure and Non-secure exceptions are identical" value="0x0"/>
        <value name="NS_DEPRIO" caption="Non-secure exceptions are de-prioritized" value="0x1"/>
      </value-group>
      <value-group name="SCB_AIRCR__SYSRESETREQ">
        <value name="NO" caption="Do not request a system reset" value="0"/>
        <value name="YES" caption="Request a system reset" value="1"/>
      </value-group>
      <value-group name="SCB_AIRCR__SYSRESETREQS">
        <value name="BOTH" caption="SYSRESETREQ functionality is available to both Security states" value="0x0"/>
        <value name="SECURE" caption="SYSRESETREQ functionality is only available to Secure state" value="0x1"/>
      </value-group>
      <value-group name="SCB_AIRCR__VECTCLRACTIVE">
        <value name="NO" caption="Do not clear active state" value="0x0"/>
        <value name="YES" caption="Clear active state" value="0x1"/>
      </value-group>
      <value-group name="SCB_SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="SCB_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SCB_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SCB_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
      <value-group name="SCB_CLIDR__Ctype">
        <value name="NO" caption="No cache" value="0"/>
        <value name="IC" caption="Instruction cache only" value="1"/>
        <value name="DC" caption="Data cache only" value="2"/>
        <value name="SEPARATE" caption="Separate instruction and data caches" value="3"/>
        <value name="UNIFIED" caption="Unified cache" value="4"/>
      </value-group>
      <value-group name="SCB_CLIDR__ICB">
        <value name="NO" caption="Not disclosed in this mechanism" value="0"/>
        <value name="L1" caption="L1 cache is the highest inner level" value="1"/>
        <value name="L2" caption="L2 cache is the highest inner level" value="2"/>
        <value name="L3" caption="L3 cache is the highest inner level" value="3"/>
      </value-group>
      <value-group name="SCB_CTR__Format">
        <value name="NO" caption="No cache type information provided" value="0"/>
        <value name="YES" caption="Cache type information is provided" value="4"/>
      </value-group>
    </module>
    <module name="SysTick" version="1.0.0" caption="SysTick Timer">
      <register-group name="SysTick" caption="SysTick Timer">
        <register name="CSR" offset="0x0" rw="RW" size="4" access-size="4" caption="SysTick Control and Status Register">
          <bitfield name="ENABLE" caption="SysTick enable" mask="0x1"/>
          <bitfield name="TICKINT" caption="Tick interrupt" mask="0x2"/>
          <bitfield name="CLKSOURCE" caption="Clock source" mask="0x4"/>
          <bitfield name="COUNTFLAG" caption="Count flag" mask="0x10000"/>
        </register>
        <register name="RVR" offset="0x4" rw="RW" size="4" access-size="4" caption="SysTick Reload Value Register">
          <bitfield name="RELOAD" caption="Counter reload value" mask="0x1000000"/>
        </register>
        <register name="CVR" offset="0x8" rw="RW" size="4" access-size="4" caption="SysTick Current Value Register">
          <bitfield name="CURRENT" caption="Current counter value" mask="0x1000000"/>
        </register>
        <register name="CALIB" offset="0xC" rw="R" size="4" access-size="4" caption="SysTick Calibration Value Register">
          <bitfield name="TENMS" caption="Ten milliseconds" mask="0xFFFFFF"/>
          <bitfield name="SKEW" caption="Skew" mask="0x40000000"/>
          <bitfield name="NOREF" caption="No reference" mask="0x80000000"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAML1xE" caption="SAML1xE">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PA02"/>
      <pin position="4" pad="PA03"/>
      <pin position="5" pad="PA04"/>
      <pin position="6" pad="PA05"/>
      <pin position="7" pad="PA06"/>
      <pin position="8" pad="PA07"/>
      <pin position="9" pad="VDDANA"/>
      <pin position="10" pad="GND"/>
      <pin position="11" pad="PA08"/>
      <pin position="12" pad="PA09"/>
      <pin position="13" pad="PA10"/>
      <pin position="14" pad="PA11"/>
      <pin position="15" pad="PA14"/>
      <pin position="16" pad="PA15"/>
      <pin position="17" pad="PA16"/>
      <pin position="18" pad="PA17"/>
      <pin position="19" pad="PA18"/>
      <pin position="20" pad="PA19"/>
      <pin position="21" pad="PA22"/>
      <pin position="22" pad="PA23"/>
      <pin position="23" pad="PA24"/>
      <pin position="24" pad="PA25"/>
      <pin position="25" pad="PA27"/>
      <pin position="26" pad="RESET_N"/>
      <pin position="27" pad="VDDCORE"/>
      <pin position="28" pad="GND"/>
      <pin position="29" pad="VSW"/>
      <pin position="30" pad="VDDIO"/>
      <pin position="31" pad="PA30"/>
      <pin position="32" pad="PA31"/>
    </pinout>
    <pinout name="SAML1xEU" caption="SAML1xEU">
      <pin position="A2" pad="PA00"/>
      <pin position="A3" pad="PA01"/>
      <pin position="A4" pad="PA02"/>
      <pin position="A5" pad="PA05"/>
      <pin position="B1" pad="VDDIO"/>
      <pin position="B2" pad="PA30"/>
      <pin position="B3" pad="PA03"/>
      <pin position="B4" pad="PA04"/>
      <pin position="B5" pad="PA07"/>
      <pin position="B6" pad="VDDANA"/>
      <pin position="C1" pad="VSW"/>
      <pin position="C2" pad="RESET_N"/>
      <pin position="C3" pad="PA31"/>
      <pin position="C4" pad="PA06"/>
      <pin position="C5" pad="PA10"/>
      <pin position="C6" pad="GNDIO"/>
      <pin position="D1" pad="GNDIO"/>
      <pin position="D2" pad="PA27"/>
      <pin position="D3" pad="PA16"/>
      <pin position="D4" pad="PA08"/>
      <pin position="D5" pad="PA11"/>
      <pin position="D6" pad="PA09"/>
      <pin position="E1" pad="VDDCORE"/>
      <pin position="E2" pad="PA25"/>
      <pin position="E3" pad="PA19"/>
      <pin position="E4" pad="PA18"/>
      <pin position="E5" pad="PA15"/>
      <pin position="E6" pad="PA14"/>
      <pin position="F2" pad="PA24"/>
      <pin position="F3" pad="PA23"/>
      <pin position="F4" pad="PA22"/>
      <pin position="F5" pad="PA17"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
